USE [Танцевальная студия]
GO

INSERT INTO Клиент
VALUES
(N'Степанова Полина Алексеевна', '22.02.1995', '+7(910)12-34-56'),
(N'Бондарева Мирослава Давидовна', '03.10.1994', '+7(123)456-78-90'),
(N'Парфенова Элина Артёмовна', '01.01.1997', '+7(956)925-58-88'),
(N'Королева Вероника Кирилловна', '30.04.1986', '+7(979)900-94-51'),
(N'Савельева Анна Ивановна', '12.03.1988', '+7(936)656-16-59'),
(N'Казакова Анна Максимовна', '26.07.1993', '+7(963)333-14-35'),
(N'Пономарев Иван Егорович', '31.07.1996', '+7(937)844-24-34'),
(N'Васильев Максим Тимофеевич', '21.07.1981', '+7(955)848-20-37'),
(N'Егоров Руслан Арсентьевич', '18.10.1985', '+7(986)537-10-71'),
(N'Алексеева Полина Ивановна', '23.08.1997', '+7(986)345-38-10'),
(N'Медведев Алексей Назарович', '22.05.1985', '+7(994)708-44-94'),
(N'Курочкина Амина Марковна', '18.10.1980', '+7(979)951-35-66'),
(N'Пономарева Таисия Вадимовна', '07.12.1988', '+7(902)899-19-43'),
(N'Кузнецова Александра Семёновна', '27.03.1986', '+7(940)703-97-14'),
(N'Кравцов Елисей Константинович', '17.06.1988', '+7(974)992-13-53')

INSERT INTO Стиль
VALUES
(N'Контемп', 300),
(N'Хип-хоп', 250),
(N'Модерн', 350),
(N'Джаз', 400),
(N'Латина', 450)

INSERT INTO [Вид абонемента]
VALUES
(1, 3, N'Контемп пробный'),
(1, 6, N'Контемп базовый'),
(1, 10, N'Контемп полный'),
(2, 2, N'Хип-хоп пробный'),
(2, 5, N'Хип-хоп базовый'),
(2, 8, N'Хип-хоп полный'),
(3, 4, N'Модерн пробный'),
(3, 7, N'Модерн базовый'),
(3, 11, N'Модерн полный'),
(4, 3, N'Джаз пробный'),
(4, 7, N'Джаз базовый'),
(4, 10, N'Джаз полный'),
(5, 4, N'Латина пробный'),
(5, 7, N'Латина базовый'),
(5, 12, N'Латина полный')

INSERT INTO Абонемент
VALUES
(1, 5, 3, 4250),
(2, 2, 0, 1800),
(3, 3, 2, 5000),
(4, 6, 1, 3000),
(5, 8, 1, 3450),
(6, 10, 4, 5200),
(3, 4, 2, 2500),
(7, 1, 0, 900),
(8, 2, 0, 1800),
(4, 3, 0, 3000),
(9, 5, 2, 3250),
(10, 12, 1, 5000),
(12, 11, 3, 5800),
(13, 5, 1, 2250),
(4, 15, 0, 5400),
(14, 2, 3, 4800),
(15, 7, 0, 1400)

INSERT INTO Группа
VALUES
(1, 115),
(2, 201),
(1, 103),
(4, 411),
(4, 412),
(2, 205),
(1, 134)

INSERT INTO [Абонементы групп]
VALUES
(1, 2),
(2, 1),
(3, 3),
(4, 6),
(5, 7),
(6, 4),
(7, 2),
(8, 3),
(9, 1),
(10, 3),
(11, 6),
(12, 4),
(13, 4),
(14, 2),
(15, 5),
(16, 1),
(17, 7)

INSERT INTO Зал
VALUES
(1, 1),
(3, 1),
(2, 1),
(5, 2),
(6, 2),
(4, 1)

INSERT INTO Преподаватель
VALUES
(N'Вешнякова Софья Евгеньевна', '22.02.1995', '+7(652)77-30-97'),
(N'Покровский Денис Сергеевич', '03.10.1994', '+7(978)384-17-47'),
(N'Кириллова Анна Сергеевна', '01.01.1997', '+7(956)925-58-88'),
(N'Соколова Екатерина Юрьевна', '30.04.1986', '+7(979)900-94-51'),
(N'Тарасова Алиса Платоновна', '12.03.1988', '+7(936)656-16-59'),
(N'Маслова Татьяна Сергеевна', '26.07.1993', '+7(963)333-14-35'),
(N'Хомяков Сергей Егорович', '31.07.1996', '+7(937)844-24-34'),
(N'Федоров Иван Евгеньевич', '21.07.1981', '+7(955)848-20-37'),
(N'Котова Ева Алексеевна', '18.10.1985', '+7(986)537-10-71'),
(N'Мельников Александр Даниилович', '23.08.1997', '+7(986)345-38-10')

INSERT INTO Занятие
VALUES
(1, 1, 4, 1, '21.04.2021', '13:00'),
(2, 2, 3, 2, '20.04.2021', '15:00'),
(3, 1, 7, 1, '21.04.2021', '16:00'),
(4, 3, 5, 4, '22.04.2021', '12:00'),
(5, 2, 3, 5, '21.04.2021', '13:00'),
(6, 4, 8, 2, '20.04.2021', '14:00'),
(7, 6, 4, 3, '22.04.2021', '11:00'),
(1, 3, 9, 1, '24.04.2021', '11:00'),
(2, 5, 10, 2, '23.04.2021', '13:00'),
(3, 2, 9, 1, '25.04.2021', '15:00'),
(4, 5, 1, 4, '24.04.2021', '12:00'),
(5, 1, 3, 5, '25.04.2021', '14:00'),
(6, 2, 8, 2, '23.02.2021', '11:00'),
(7, 4, 6, 3, '24.02.2021', '12:00')

INSERT INTO [Индивидуальное занятие]
VALUES
(1, 3, '20.04.2021', '13:00'),
(1, 3, '22.04.2021', '12:00'),
(1, 3, '24.04.2021', '15:00'),
(3, 4, '21.04.2021', '11:00'),
(3, 4, '23.04.2021', '12:00'),
(4, 8, '22.04.2021', '13:00'),
(5, 4, '25.04.2021', '16:00'),
(6, 1, '22.04.2021', '11:00'),
(6, 1, '24.04.2021', '14:00'),
(3, 9, '23.04.2021', '16:00'),
(3, 9, '25.04.2021', '12:00'),
(9, 2, '23.04.2021', '11:00'),
(12, 5, '20.04.2021', '15:00'),
(12, 5, '21.04.2021', '16:00'),
(14, 10, '23.04.2021', '15:00')

INSERT INTO Сертификат
VALUES
(1, 3),
(3, 2),
(2, 5),
(4, 1),
(5, 4),
(7, 1),
(1, 4),
(8, 2),
(4, 3),
(9, 4),
(9, 1),
(10, 2),
(3, 5),
(6, 3)