SELECT *
 FROM Абоненты;
-----------------------------------------------------------
SELECT *
 FROM Книги
 WHERE Шифр IN (SELECT Книга 
				 FROM ВыдачаКниг 
                 WHERE Абонент=2 OR Абонент=4
               )
-----------------------------------------------------------
SELECT Абонент,COUNT(Книга) AS [Количество выданных книг]
 FROM ВыдачаКниг
 GROUP BY Абонент
-----------------------------------------------------------
SELECT * FROM [Выдача Книг Viev]
-----------------------------------------------------------
DECLARE @name nchar(50)
EXEC toName 1,@name OUTPUT
print 'Название книги: ' + @name
-----------------------------------------------------------
DECLARE @bookCount int
EXEC toBooksCount 1,@bookCount OUTPUT
print @bookCount